# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]
module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939]
module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.simple_email_service.aws_ses_domain_identity.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default: Refreshing state... [id=upstash_kafka_cluster_id]
module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default: Refreshing state... [id=mail.connectilly.com]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_gl21W78mM]
module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider: Refreshing state... [id=us-east-1_gl21W78mM:Google]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default: Refreshing state... [id=connectilly]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.common_resources.aws_secretsmanager_secret.kafka_topic_credential will be created
  + resource "aws_secretsmanager_secret" "kafka_topic_credential" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "upstash_kafka_credential"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)
    }

  # module.common_resources.aws_secretsmanager_secret_version.secret_version will be created
  + resource "aws_secretsmanager_secret_version" "secret_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google_provider" {
        id                = "us-east-1_gl21W78mM:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "upstash_kafka_cluster_credential"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-topic-credential"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-topic-credential"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = "3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9"
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "all"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "ALL"
      + state           = (known after apply)
      + topic           = "*"
      + username        = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*